# List and dictionary

In [4]:
lst = [0,1,2,3,4,5]

In [5]:
lst[0]

0

In [6]:
lst[3]

3

In [7]:
lst[0:4]

[0, 1, 2, 3]

In [8]:
lst[-1]

5

In [9]:
lst=lst+[3.14,2.3,1,0,9,4]    #adding more digits in upper list

In [10]:
lst

[0, 1, 2, 3, 4, 5, 3.14, 2.3, 1, 0, 9, 4]

In [11]:
type(lst[4])

int

In [12]:
# add string 
lst=lst+['ucp','umt','pac','pgc']

In [13]:
lst

[0, 1, 2, 3, 4, 5, 3.14, 2.3, 1, 0, 9, 4, 'ucp', 'umt', 'pac', 'pgc']

In [14]:
type(lst[12])

str

In [15]:
lst.extend([12,34,5,6,7,89,0])   #built in function for extanding list

In [16]:
lst

[0,
 1,
 2,
 3,
 4,
 5,
 3.14,
 2.3,
 1,
 0,
 9,
 4,
 'ucp',
 'umt',
 'pac',
 'pgc',
 12,
 34,
 5,
 6,
 7,
 89,
 0]

In [18]:
lst.append(['hy','here'])

In [19]:
lst

[0,
 1,
 2,
 3,
 4,
 5,
 3.14,
 2.3,
 1,
 0,
 9,
 4,
 'ucp',
 'umt',
 'pac',
 'pgc',
 12,
 34,
 5,
 6,
 7,
 89,
 0,
 ['hy', 'here']]

In [20]:
lst[-1]

['hy', 'here']

In [21]:
lst[-1][1]

'here'

In [22]:
lst[-1][1][2]

'r'

In [24]:
lst.insert(5,555)

In [25]:
lst

[0,
 1,
 2,
 3,
 4,
 555,
 5,
 3.14,
 2.3,
 1,
 0,
 9,
 4,
 'ucp',
 'umt',
 'pac',
 'pgc',
 12,
 34,
 5,
 6,
 7,
 89,
 0,
 ['hy', 'here']]

In [27]:
#del    index need and delete that index
#remove  remove 
#pop    delete last index value

In [28]:
del lst[5]

In [29]:
lst

[0,
 1,
 2,
 3,
 4,
 5,
 3.14,
 2.3,
 1,
 0,
 9,
 4,
 'ucp',
 'umt',
 'pac',
 'pgc',
 12,
 34,
 5,
 6,
 7,
 89,
 0,
 ['hy', 'here']]

In [35]:
lst.remove('umt')

In [36]:
lst

[0,
 1,
 2,
 3,
 4,
 5,
 3.14,
 2.3,
 1,
 0,
 9,
 4,
 'pac',
 'pgc',
 12,
 34,
 5,
 6,
 7,
 89,
 0,
 ['hy', 'here']]

In [37]:
lst.pop()

['hy', 'here']

In [49]:
for x in lst:
    if type(x)== int:
        print('2')
        lst.remove(x)

2
2
2
2
2
2
2
2
2
2

In [50]:
lst

[1, 2.3, 3.14, 4, 9, 34, 6, 89, 0]

In [53]:
lst.sort()

lst

In [73]:
#dictionary
#key =value(s)
d={'Country':['pakistan','iran','indai','china'],'Capital' : ['islamabad','tehran','Dehli','usa'],'Population':[1233,34432,9987,8987]}

In [74]:
d.items() #display contect

dict_items([('Country', ['pakistan', 'iran', 'indai', 'china']), ('Capital', ['islamabad', 'tehran', 'Dehli', 'usa']), ('Population', [1233, 34432, 9987, 8987])])

In [75]:
d

{'Country': ['pakistan', 'iran', 'indai', 'china'],
 'Capital': ['islamabad', 'tehran', 'Dehli', 'usa'],
 'Population': [1233, 34432, 9987, 8987]}

In [76]:
d.keys()

dict_keys(['Country', 'Capital', 'Population'])

In [77]:
d.values()

dict_values([['pakistan', 'iran', 'indai', 'china'], ['islamabad', 'tehran', 'Dehli', 'usa'], [1233, 34432, 9987, 8987]])

In [78]:
for v in d.values():
    print(v)

['pakistan', 'iran', 'indai', 'china']
['islamabad', 'tehran', 'Dehli', 'usa']
[1233, 34432, 9987, 8987]

In [79]:
for k in d.keys():
    print(k)

Country
Capital
Population

In [80]:
for k,v in d.items():
    print(k,'=>',v)

Country => ['pakistan', 'iran', 'indai', 'china']
Capital => ['islamabad', 'tehran', 'Dehli', 'usa']
Population => [1233, 34432, 9987, 8987]

In [67]:
#tabular form 
#pandas

# Pandas

In [81]:
import pandas as pd

In [83]:
df=pd.DataFrame.from_dict(d)

In [84]:
df.to_csv(r'pbd_d2.csv',index=False,header=True)

In [85]:
df

    Country    Capital  Population
0  pakistan  islamabad        1233
1      iran     tehran       34432
2     indai      Dehli        9987
3     china        usa        8987

In [86]:
df.to_csv(r'pbd_d2.csv')

In [87]:
df

    Country    Capital  Population
0  pakistan  islamabad        1233
1      iran     tehran       34432
2     indai      Dehli        9987
3     china        usa        8987

In [88]:
dff=pd.read_csv('pbd_d2.csv')

In [89]:
dff

   Unnamed: 0   Country    Capital  Population
0           0  pakistan  islamabad        1233
1           1      iran     tehran       34432
2           2     indai      Dehli        9987
3           3     china        usa        8987

In [90]:
df.to_csv(r'pbd_d2.csv',index=False,header=True)

In [91]:
df

    Country    Capital  Population
0  pakistan  islamabad        1233
1      iran     tehran       34432
2     indai      Dehli        9987
3     china        usa        8987

In [92]:
dff=pd.read_csv('pbd_d2.csv')

In [93]:
dff

    Country    Capital  Population
0  pakistan  islamabad        1233
1      iran     tehran       34432
2     indai      Dehli        9987
3     china        usa        8987

In [94]:
dff.head(3)

    Country    Capital  Population
0  pakistan  islamabad        1233
1      iran     tehran       34432
2     indai      Dehli        9987

In [95]:
dff.tail(3)

  Country Capital  Population
1    iran  tehran       34432
2   indai   Dehli        9987
3   china     usa        8987

In [96]:
dff

    Country    Capital  Population
0  pakistan  islamabad        1233
1      iran     tehran       34432
2     indai      Dehli        9987
3     china        usa        8987

In [97]:
t=(1,2,3,4)

In [98]:
type(t)

tuple

In [99]:
t[0]

1